tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "xz"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "boost"
brew "chezmoi"
brew "cloc"
brew "openssl@3"
brew "exa"
brew "fd"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "go"
brew "htop"
brew "libzip"
brew "katago"
brew "lazygit"
brew "lf"
brew "libmagic"
brew "midnight-commander"
brew "neovim"
brew "readline"
brew "nnn"
brew "node"
brew "sqlite"
brew "pipx"
brew "pyenv"
brew "ranger"
brew "ripgrep"
brew "tcl-tk"
brew "trash-cli"
brew "tree"
brew "wget"
brew "zlib"
brew "zsh-syntax-highlighting"
cask "alfred"
cask "anki"
cask "drawio"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "katrain"
cask "kindle"
cask "maccy"
cask "sigil"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.rtf"
vscode "asvetliakov.vscode-neovim"
vscode "bhughes339.replacerules"
vscode "circlecodesolution.ccs-flutter-color"
vscode "darkriszty.markdown-table-prettify"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "devmuaz.flutterhookssnippets"
vscode "donjayamanne.githistory"
vscode "DotJoshJohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "Gruntfuggly.todo-tree"
vscode "hirantha.json-to-dart"
vscode "hzgood.dart-data-class-generator"
vscode "janisdd.vscode-edit-csv"
vscode "joekon.ssmacro"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "Nash.awesome-flutter-snippets"
vscode "PKief.material-icon-theme"
vscode "plibither8.remove-comments"
vscode "redhat.vscode-xml"
vscode "robert-brunhage.flutter-riverpod-snippets"
vscode "TakumiI.markdowntable"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
